/*────────────────────────────────────────────────────────────────────────────────────────────────*/

require('app.init')(
/*┌────────────────┐
  │ Базовые модули │
  └────────────────┘*/[
    'File'// Модуль для работы файлом
],

/*┌─────────────────────────┐
  │ Пользовательские модули │
  └─────────────────────────┘*/[
    './inc/Projects.js',// Управление проектами
    './inc/Project.js',// Управление проектом
    './inc/Server.js'// Сервер
]
);
/*────────────────────────────────────────────────────────────────────────────────────────────────*/